delete from ecotiya_com.m_section_comment;
insert into ecotiya_com.m_section_comment(section_kind_code,section_comment_line,section_comment,title_flg) values 
    ('career',1,'社会における小さな課題を解決できるエンジニアになる。','1')
  , ('career',2,'

【経緯】
高校生の当時、自転車で祖母の家へ通っていた私は、祖母との会話の中で、病院での待ち時間が長く疲れるという話を聞いていました。

やりたいことがなく、進路に迷っていた私はふと、祖母の話を思い出し、インターネットで検索した際に、電子カルテシステムというものがあることを知りました。
それがきっかけで、パソコンが好きという理由もあわさり、情報系専門学校に進学します。

そのシステムは紙ではなく、データで医療情報を管理しており、紙カルテを保管場所から探し出す行為の削減や書類作成の簡略化により、
診療業務や事務対応の効率化が図れる可能性があり、それは祖母のようなお年寄りの方々を幸せにする可能性があるシステムでした。


【理由】
これは私がエンジニアとなった話の始まりですが、私は大きな野望を持つのではなく、まずは小さな課題を解決することを目指します。

今までもプロジェクトの中で可能なものではあれば積極的に提案をし、それを顧客へ提供してきた実績があります。

まずは若いうちは大きな野望を持つ前に、小さな提案から積み重ねることに注力する。
やがて自身を身に着け、サービス自体を提案してみるようになる。

自分がユーザー視点になって考えたときに、本当に心から使いたいかを考えられる、心の通ったシステムを作るエンジニアを目指します。','0')
  , ('profile',1,'医療系の自社開発会社及び、受託開発会社にてシステム開発を5年以上経験があります。要件定義、基本設計、詳細設計、開発、保守、運用とシステム構築に関わる上流工程から下流工程までフェーズを通して経験しており、手を動かすエンジニアとして、業務を遂行してまいりました。
過去7言語を利用した実装経験があり、技術的な部分へのキャッチアップの速さには自信があります。','0')
  , ('skill',1,'プライベートでのみ触れたことがある。','0')
  , ('skill',2,'プロダクトでコミットしたことがある。定常的には開発していない。','0')
  , ('skill',3,'プロダクトでコミットしたことがある or 定常的に開発していたことがある。トラブルシュートもある程度は聞きながら対応可能。','0')
  , ('skill',4,'自分で開発可能、トラブルシュートも対応可能、人に教えることも可能。','0')
  , ('skill',5,'深いレベルでの知識を有しており、コードレベルで理解している。','0');
