delete from kos0514_com.m_career;
insert into kos0514_com.m_career(career_date,career_division,career_title,career_contents) values 
    ('1995/02','3','わたくし、誕生。','大分県に生まれる。')
  , ('2013/04','1','情報専門学校','３年制の情報専門学校に通い、医療情報について学び、医療情報技師や基本情報技術者の資格を取得。')
  , ('2016/04','2','医療系自社開発企業','大学病院向けの新規電子カルテシステムの開発、モバイルアプリの開発に従事。')
  , ('2017/12','2','アルバイト','前職を退職後、転職先の仕事の繋ぎとして、丸亀製麺および、郵便局の深夜アルバイトを実施。サービス業の辛さを実感する。')
  , ('2018/01','2','受託開発企業','Java言語をメインに業務での開発を行う。計4年間、お世話になった上司にさまざまな挑戦をさせていただき、私が対応できたことで、技術力・コミュニケーション能力が向上する。')
  , ('2020/05','2','SES企業','受託開発企業でお世話になった上司に誘われ、転職。')
  , ('2022/05','2','フリーランスエンジニア','現在は、Java言語をメインに活動している。

今後、Java以外の言語にも携わりたいと考えており、公式サイトの実装を通じて、業務で未経験のReact・TypeScript・Docker・AWSを学習中。');
