insert into ecotiya_com.m_career(career_date,career_division,career_title,career_contents) values 
    ('2016/03','1','専門学校卒業','専門学校卒業')
  , ('2016/04','2','自社開発系企業入社','自社開発系企業入社')
  , ('2016/11','2','自社開発系企業退社','自社開発系企業退社')
  , ('2017/12','2','金稼ぎのため、アルバイト','丸亀製麺および、郵便局の深夜アルバイト')
  , ('2018/01','2','受託開発系企業入社','受託開発系企業入社')
  , ('2020/04','2','受託開発系企業退社','受託開発系企業退社')
  , ('2020/05','2','SES企業入社','SES企業入社')
  , ('2022/04','2','SES企業退社','SES企業退社')
  , ('2022/05','2','フリーランスエンジニア','フリーランスエンジニア');


insert into ecotiya_com.m_inquiry_kinds(inquiry_kind_code,inquiry_kind_name,sortno) values 
    ('official_site','本サイトについて',4)
  , ('others','その他',3)
  , ('question','ご質問',2)
  , ('request','ご要望',1);


insert into ecotiya_com.m_section_comment(section_kind_code,section_comment_line,section_comment,title_flg) values 
    ('career',1,'社会における小さな課題を解決できるエンジニアになる。','1')
  , ('career',2,'----------


【経緯】
高校生の当時、自転車で祖母の家へ通っていた私は、祖母との会話の中で、病院での待ち時間が長く疲れるという話を聞いていました。

やりたいことがなく、進路に迷っていた私はふと、祖母の話を思い出し、インターネットで検索した際に、電子カルテシステムというものがあることを知りました。
それがきっかけで、パソコンが好きという理由もあわさり、情報系専門学校に進学します。

そのシステムは紙ではなく、データで医療情報を管理しており、紙カルテを保管場所から探し出す行為の削減や書類作成の簡略化により、
診療業務や事務対応の効率化が図れる可能性があり、それは祖母のようなお年寄りの方々を幸せにする可能性があるシステムでした。


【理由】
これは私がエンジニアとなった話の始まりですが、私は大きな野望を持つのではなく、まずは小さな課題を解決することを目指します。

今までもプロジェクトの中で可能なものではあれば積極的に提案をし、それを顧客へ提供してきた実績があります。

まずは若いうちは大きな野望を持つ前に、小さな提案から積み重ねることに注力する。
やがて自身を身に着け、サービス自体を提案してみるようになる。

自分がユーザー視点になって考えたときに、本当に心から使いたいかを考えられる、心の通ったシステムを作るエンジニアを目指します。','0')
  , ('profile',1,'ウイイイイイイイッッッッス。どうも、シャムでーす。 まぁ今日はオフ会、当日ですけども。 えーとですね、まぁ集合場所の、えーイオンシネマに行ってきたんですけども、ただいまの時刻は1時を回りました。 はい、ちょっと遅れて来たんですけどもね。えー11時ちょっとすぎくらいに、えーイオンシネマに行ったんですけども。 ほんでーまぁイオンシネマの全体の動画を撮った後に行ったんですけども。スィー。 ほんでーかれこれまぁ2時間くらい、えー待ったんですけども参加者は誰一人来ませんでした。ガチャ。 誰一人来ることなかったですぅ。残念ながら。はい。 一人くらい来るやろうなーと思ってたんですけども、スゥー、結局2時間くらい待っても誰一人来ませんでしたね、えぇ。 でもね、でもオフ会のお知らせの動画にちらほらコメントあったんですけどもね。えー参加者の方の。 なんだろう。なんで来なかったんでしょうかねー。 まぁーもう一時間くらい待とうと思ったんですけども今日はね、えーまぁみんなとお昼ごはん食べるつもりだったし、 あっ夜ご飯もみんなと一緒に食べようかなと思ってたんで今日は朝、パン一枚でございます。 今日の朝食はパン一枚！ なのでもう1時間待とうと思ったけどさすがにちょっと腹ペコなんで、えー今回のオフ会は残念ながら、こういう悲しい結果で終わりですね。 たぶんねぇあのまま待っててももう誰も来んかなぁと思ってたし、スィー、かといっても誰も来る気配なかったんで、カチッ、もうこれアカンなぁと思って、えーいま車に戻って、えー動画を撮影しております。 なんだろうなぁー。情報が足りんかったんかなぁー。 でもちゃんと載せて、載せて、載せたつもりなんですけどもねぇー。カチッ。 イオンシネマのーURLも載せたし、でー駅探で新大阪から垂井までの駅探の情報も載せていたんですけど一体なにが足りんかったんでしょうかねぇー。 あのねー、まぁイオンシネマで一人でずーっと待ってたわけですよ。 最初はちょっとイオンシネマのフロアロビーをうろちょろしてたんだけど、ちょっと足がちょっとしんどくなってきて、ずーあれそれからずーっとイスに座ってた、カチッ、座ってたけど、シー、誰一人来ることなかったですね。はい。 スー一体なにがダメだったんでしょうかねぇー。参加者はいると思うんですけどなぜ来なかったんでしょうかね。不思議ですね。 なんかプレゼント持って行くよっていう人がおったんだけどそれらしい人もおらんかったし。 まぁ女子24人で男4人、28人やろ計、そのような団体さんもまったくいる気配はなかったし。 女子ぐー十人ぐらいでいきまーすってコメントもあったんやけどそれらしい人もおらんかったし、なんだろう。 今日、8月11日だよね？オフ会、当日だよね？ なんだろう。なんで来んかったんかなぁ。なんで来なかったんやろかなぁ、みんな。 あれ？もしかしてみな、みんなー場所わかってた？ 俺がさー不安なのは一番不安だったのはコメント返信でね。場所分かりますか？っていうコメント返信したんだけどまったく返信なくて。 ホンマに場所分かってんかいなぁっていう不安がいっぱいで今日、当日迎えたから。 もしかしたら場所分かってなかったかもしんないねぇーみんな。 うーん、なんでだろうねぇ。なんで来なかったんだろうか。謎ですね。スゥー。 ちょっとーみん、さすがに参加者0人はねぇ。へこんでますねぇーえぇ。 そうですねぇー次のオフ会はまた、そやな夏休み明けやろうかな。 あのねー、いま夏休みやからイオンシネマ多かったわ、人が、人でいっぱいやったわ。うん。プスゥー。 そやねー自分としてはリベンジしたいんだけどね。泉南イオン、場所は泉南イオンで。スゥー。 なんだろうぉ、ちょっといま夏休みやし、夏休み明けやろうかな。9月ごろ。スゥ、やろうかな。 今度は土日で。やろうかなと思ってますよ。スィー。 いや、あのぉー今度ね、今度ぉーコラボジャパンさんの方でゲーム実況者イベントがあるんですよ、とYoutubeスペーストーキョーで。 で、もしかしたら俺が呼ばれるかもしれな、しめ、しれないのでぇー、でーゲーム実況者イベントの中にね、ファンとの交流会っていうのがあるんですよ。 それにみんな来てもらおうかなって思って、はい。 とりあえずぅー、今回のオフ会は残念ながら参加者0人という形で終わりました。チッ、はい、チッ、スゥ。 なんかねぇーそーとーショックですねぇー。なんで来なかったんだろうって思いがあります。スゥー、はい。 まぁ腹も減ってくるしは、腹も減ってくるし、誰も来んしっていう、なんだろう。 まぁとにかくむなしかったし、一人でずーっと待って2時間くらい待ってたけどそれがむなしかったし、スィー、なんで来なかったんだろうって思いとまぁ情報が足りなかったかもしれへんし、今回は。はい、それが、それもあるかもしれないね、はい。 まっ、ちょっとーなんでしょうかね。泉南イオンに来たよーって人はぜひえーコメントください。スィー。 もしかしたらすれ違いっていう可能性もあるかもしれへんし。 いやっ、あのまま待ってても誰も来んかったかなぁと思いますし。スィー。 まぁー自分はですね、オフ会やりたかったし、今回はこういう形で終わりましたけど。 まぁこれでまぁ自分自身もオフ会やりたかったし、今回はこれでええかなぁっと納得しております。スィー。 もし、参加者様で、もし泉南イオンのイオンシネマに来たよーっていう人はぜひコメントください。','0')
  , ('skill',1,'プライベートでのみ触れたことがある。','0')
  , ('skill',2,'プロダクトでコミットしたことがある。定常的には開発していない。','0')
  , ('skill',3,'プロダクトでコミットしたことがある or 定常的に開発していたことがある。トラブルシュートもある程度は聞きながら対応可能。','0')
  , ('skill',4,'自分で開発可能、トラブルシュートも対応可能、人に教えることも可能。','0')
  , ('skill',5,'深いレベルでの知識を有しており、コードレベルで理解している。','0');


insert into ecotiya_com.m_section_title(section_kind_code,section_title,section_sub_title,remarks1,remarks2,show_flg) values 
    ('career','【経歴】','エンジニア人生を開始してから、今日までの歩みです。ぜひ、ご覧ください。',null,null,'1')
  , ('contact','【お問い合わせ】','ここまで、ご覧いただきありがとうございます。私への問い合わせは、下記フォームもしくはTwitterのDMをご利用ください。',null,null,'1')
  , ('profile','【私について】','エンジニア「ecotiya」のポートフォリオサイトです。あなたに、私のことを知ってもらうために、経歴・スキルをまとめています。気軽にご覧ください。','/assets/ecotiya.png','ecotiya','1')
  , ('skill','【スキルセット】','私のスキルセットを下記テーブルにまとめました。テーブルの表示内容は[経験年数 降順] [レベル 降順]でソートしており、レベル1の技術に関しては今後、強みとしていきたい、勉強中の技術です。',null,null,'1');


insert into ecotiya_com.m_skill(skill_field_code,skill_name,category,skill_level,experience_ym) values 
    ('Backend','.NET Framework','フレームワーク',3,1.5)
  , ('Backend','C#','プログラミング言語',2,0.5)
  , ('Backend','Caché','データベース',3,1.5)
  , ('Backend','Java','プログラミング言語',4,4.0)
  , ('Backend','Microsoft SQL Server','データベース',2,0.5)
  , ('Backend','MySQL','データベース',4,2.0)
  , ('Backend','Oracle Database','データベース',2,0.5)
  , ('Backend','Perl','プログラミング言語',2,0.5)
  , ('Backend','PHP','プログラミング言語',2,0.5)
  , ('Backend','PostgreSQL','データベース',4,2.0)
  , ('Backend','PowerShell','スクリプト言語',3,0.5)
  , ('Backend','Spring Boot','フレームワーク',4,3.0)
  , ('Backend','VB.NET','プログラミング言語',3,1.5)
  , ('Backend','VBA(Visual Basic for Applications)','プログラミング言語',4,1.0)
  , ('DevOps','Amazon Web Services','クラウド',1,0.5)
  , ('DevOps','Apache Subversion','バージョン管理',3,1.5)
  , ('DevOps','Docker','コンテナ',1,0.5)
  , ('DevOps','Docker Compose','コンテナ',1,0.5)
  , ('DevOps','Git','バージョン管理',3,4.0)
  , ('DevOps','GitHub','バージョン管理',3,3.0)
  , ('DevOps','nginx','Webサーバ',1,0.5)
  , ('DevOps','Vagrant','仮想環境',2,0.5)
  , ('Frontend','Apache Velocity','テンプレートエンジン',4,2.0)
  , ('Frontend','JavaScript','スクリプト言語',3,2.0)
  , ('Frontend','jQuery','JavaScriptライブラリ',3,1.5)
  , ('Frontend','JSP(JavaServer Page)','テンプレートエンジン',4,1.0)
  , ('Frontend','MUI(‎Material-UI)','デザインライブラリ',1,0.5)
  , ('Frontend','React','JavaScriptライブラリ',1,0.5)
  , ('Frontend','TypeScript','プログラミング言語',1,0.5);

